Reports/БДР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>БДР</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/СтруктураСметыПоГодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтруктураСметыПоГодам</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураСметы</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтруктураСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>СтруктураСметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Структура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПересчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеРКО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРКО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдвиг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоОплате</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/БДР/Ext/ObjectModule.bsl
Функция БюджетПоЗадачеПроекта( Параметры ) Экспорт
	//Бюджет по задаче [#129530]	
	//Формируем бюджет план/факт по задаче
	
	тзБюджет = Новый ТаблицаЗначений;
	тзБюджет.Колонки.Добавить("ЗадачаПроекта");
	тзБюджет.Колонки.Добавить("КодСтатьи");
	тзБюджет.Колонки.Добавить("Статья");
	тзБюджет.Колонки.Добавить("Месяц");
	тзБюджет.Колонки.Добавить("ТипСуммы");
	тзБюджет.Колонки.Добавить("ВидПлана");        
	тзБюджет.Колонки.Добавить("СуммаПоСтатье");
	тзБюджет.Колонки.Добавить("Источник");
	
	ГодЗадач = Параметры.ГодЗадач.Значение;
	
	Если ГодЗадач = Неопределено Тогда 
		Сообщить("Год задач не заданы");
		Возврат тзБюджет;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БюджетПоМесяцам.ЗадачаПроекта КАК ЗадачаПроекта,
	               |	БюджетПоМесяцам.ЗадачаПроекта.ГодЗадачи КАК ГодЗадачаПроекта,
	               |	СтруктураСметыСтруктура.Статья КАК Статья,
	               |	БюджетПоМесяцам.Месяц КАК Месяц,
	               |	БюджетПоМесяцам.ТипСуммы КАК ТипСуммы,
	               |	БюджетПоМесяцам.ВидПлана КАК ВидПлана,
	               |	БюджетПоМесяцам.Сумма КАК СуммаПоСтатье,
	               |	БюджетПоМесяцам.Регистратор
	               |ИЗ
	               |	РегистрСведений.СтруктураСметыПоГодам КАК СтруктураСметыПоГодам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураСметы.Структура КАК СтруктураСметыСтруктура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
	               |			ПО (БюджетПоМесяцам.СтатьяСметы = СтруктураСметыСтруктура.Статья)
	               |		ПО (ГОД(СтруктураСметыПоГодам.Период) = БюджетПоМесяцам.ЗадачаПроекта.ГодЗадачи)
	               |			И СтруктураСметыПоГодам.СтруктураСметы = СтруктураСметыСтруктура.Ссылка
	               |ГДЕ
	               |	БюджетПоМесяцам.ТипСуммы <> &ТипСуммы
	               |	И БюджетПоМесяцам.ЗадачаПроекта.ГодЗадачи = &ГодЗадач";
	
	
	Запрос.УстановитьПараметр("ГодЗадач", ГодЗадач);
	Запрос.УстановитьПараметр("ТипСуммы", Перечисления.ТипСуммыБюджета.ПервичныйДокумент);
	
	Если Параметры.ТиповыеЗадачи.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.ТиповаяЗадача В ИЕРАРХИИ(&ТиповыеЗадачи)";
		Запрос.УстановитьПараметр("ТиповыеЗадачи", Параметры.ТиповыеЗадачи.Значение);
	КонецЕсли;
	
	Если Параметры.СтатусыПроектов.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.Владелец.Статус В(&СтатусыПроектов)";
		Запрос.УстановитьПараметр("СтатусыПроектов", Параметры.СтатусыПроектов.Значение);
	КонецЕсли;
	
	// Добавлено 28.05.2018 по задаче #129698 Гумедин А.Г.
	Если Параметры.Кураторы.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.Владелец.Куратор В (&Кураторы)";
		Запрос.УстановитьПараметр("Кураторы", Параметры.Кураторы.Значение);
	КонецЕсли;
	
	Если Параметры.Менеджеры.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.Владелец.МенеджерПроекта В (&Менеджеры)";
		Запрос.УстановитьПараметр("Менеджеры", Параметры.Менеджеры.Значение);
	КонецЕсли;
	
	Если Параметры.Директора.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.Владелец.ДиректорПроекта В (&Директора)";
		Запрос.УстановитьПараметр("Директора", Параметры.Директора.Значение);
	КонецЕсли;
	
	Если Параметры.Подразделения.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.Подразделение В (&Подразделения)";
		Запрос.УстановитьПараметр("Подразделения", Параметры.Подразделения.Значение);
	КонецЕсли;
	
	Если Параметры.ВидыЗадач.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи В (&ВидыЗадач)";
		Запрос.УстановитьПараметр("ВидыЗадач", Параметры.ВидыЗадач.Значение);
	КонецЕсли;
	
	Если Параметры.ВидыНоменклатуры.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И БюджетПоМесяцам.ЗадачаПроекта.ТиповаяЗадача.ВидНоменклатуры В (&ВидыНоменклатуры)";
		Запрос.УстановитьПараметр("ВидыНоменклатуры", Параметры.ВидыНоменклатуры.Значение);
	КонецЕсли;
	////////////////////////////////////////////////////////
		
//	Если Параметры.ТиповыеЗадачи.Значение.Количество() > 0 Тогда
//		Запрос.УстановитьПараметр("ТиповыеЗадачи", Параметры.ТиповыеЗадачи.Значение);
//	КонецЕсли;;
	
//	Если Параметры.СтатусыПроектов.Значение.Количество() > 0 Тогда
//		Запрос.УстановитьПараметр("СтатусыПроектов", Параметры.СтатусыПроектов.Значение);
//	КонецЕсли;;
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	//тзРезультат.Свернуть("ГодЗадачаПроекта, ЗадачаПроекта, Статья, Месяц, ТипСуммы, ВидПлана", "СуммаПоСтатье");
	
	тзПоГодам = тзРезультат.Скопировать();
	тзПоГодам.Свернуть("ГодЗадачаПроекта");
	
	тзПоПериодам = тзРезультат.Скопировать();
	тзПоПериодам.Свернуть("ГодЗадачаПроекта, ЗадачаПроекта, Месяц, ТипСуммы, ВидПлана");
	
	//По годам, т.к. может быть разная структура смет
	Для Каждого итераторГод Из тзПоГодам Цикл
		//сСметы - структура сметы
		сСметы 	= УП_СметаПроекта.ПолучитьСтруктуруСметыЗадачи( итераторГод.ГодЗадачаПроекта );
		
		Для Каждого итераторПериод Из тзПоПериодам Цикл
			Отбор = Новый Структура();
			Отбор.Вставить("ГодЗадачаПроекта",итераторГод.ГодЗадачаПроекта);
			Отбор.Вставить("ЗадачаПроекта", итераторПериод.ЗадачаПроекта);
			Отбор.Вставить("Месяц", итераторПериод.Месяц);
			Отбор.Вставить("ТипСуммы", итераторПериод.ТипСуммы);
			Отбор.Вставить("ВидПлана", итераторПериод.ВидПлана);

			тзРезультатЗаПериод = тзРезультат.Скопировать(Отбор);
			
			Если итераторПериод.Месяц <> Null Тогда
				Для Каждого СтрСметы ИЗ сСметы Цикл
					ОтборСтатья = Новый Структура();
					ОтборСтатья.Вставить("Статья", СтрСметы.Значение.Статья);
					
					рез = тзРезультатЗаПериод.НайтиСтроки(ОтборСтатья);
					Если рез.Количество() > 0 Тогда 
						Для Каждого стр Из рез Цикл
							бюджет = тзБюджет.Добавить();
							бюджет.ЗадачаПроекта = итераторПериод.ЗадачаПроекта;
							бюджет.КодСтатьи = СтрСметы.Значение.КодСтатьи;
							бюджет.Статья = СтрСметы.Значение.Статья;
							бюджет.Месяц = итераторПериод.Месяц;
							бюджет.ТипСуммы = итераторПериод.ТипСуммы;
							бюджет.ВидПлана = итераторПериод.ВидПлана;
							бюджет.СуммаПоСтатье = стр.СуммаПоСтатье;
							бюджет.Источник = стр.Регистратор;
						КонецЦикла;
					Иначе
							бюджет = тзБюджет.Добавить();
							бюджет.ЗадачаПроекта = итераторПериод.ЗадачаПроекта;
							бюджет.КодСтатьи = СтрСметы.Значение.КодСтатьи;
							бюджет.Статья = СтрСметы.Значение.Статья;
							бюджет.Месяц = итераторПериод.Месяц;
							бюджет.ТипСуммы = итераторПериод.ТипСуммы;
							бюджет.ВидПлана = итераторПериод.ВидПлана;
							бюджет.СуммаПоСтатье = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат тзБюджет;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	НастройкиСКД		= КомпоновщикНастроек.ПолучитьНастройки();
	
	//Получение самой СКД из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	
	
	//Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД, ДанныеРасшифровки );
	
	//Связь между таблицей значений и именами в СКД
	ВнешниеНаборыДанных = Новый Структура;
//	ВнешниеНаборыДанных.Вставить("ТаблицаДоходов", РаспределениеДоходовПоЗадачеПроекта( ЗадачаПроекта ));
	// параметры из СКД
	ВнешниеНаборыДанных.Вставить("Бюджет", БюджетПоЗадачеПроекта( МакетКомпоновки.ЗначенияПараметров ));
	
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);

	//Вывод результата
	ДокументРезультат.Очистить(); 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

	//ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб=Истина;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры
